maze = [
    [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9],
    [9, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 9],
    [9, 0, 9, 0, 0, 0, 9, 9, 0, 9, 9, 9],
    [9, 0, 9, 9, 0, 9, 0, 0, 0, 9, 0, 9],
    [9, 0, 0, 0, 9, 0, 0, 9, 9, 0, 9, 9],
    [9, 9, 9, 0, 0, 9, 0, 9, 0, 0, 0, 9],
    [9, 0, 0, 0, 9, 0, 9, 0, 0, 9, 1, 9],
    [9, 0, 9, 0, 0, 0, 0, 9, 0, 0, 9, 9],
    [9, 0, 0, 9, 0, 9, 0, 0, 9, 0, 0, 9],
    [9, 0, 9, 0, 9, 0, 9, 0, 0, 9, 0, 9],
    [9, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 9],
    [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]
]

pos = [[1, 1, 0]] # start position

while len(pos) > 0:
    x, y, depth = pos.pop(0)

    # ゴールに到着したら終了
    if maze[x][y] == 1:
        print(depth)
        break

    maze[x][y] = 2

    if maze[x - 1][y] < 2:
        pos.append([x - 1, y, depth + 1]) #left
    if maze[x + 1][y] < 2:
        pos.append([x + 1, y, depth + 1]) #right
    if maze[x][y - 1] < 2:
        pos.append([x, y - 1, depth + 1]) #under
    if maze[x][y + 1] < 2:
        pos.append([x, y + 1, depth + 1]) #upper