data = [6, 15, 4, 2, 8, 5, 11, 9, 7, 13]

# ヒープを構成
for i in range(len(data)):
    j = i
    while (j>0) and (data[(j-1)//2]<data[j]):
        data[(j-1)//2], data[j] = data[j], data[(j-1)//2]
        j = (j-1)//2

    print('data: ', data)
    """
    data:  [6, 15, 4, 2, 8, 5, 11, 9, 7, 13]
    data:  [15, 6, 4, 2, 8, 5, 11, 9, 7, 13]
    data:  [15, 6, 4, 2, 8, 5, 11, 9, 7, 13]
    data:  [15, 6, 4, 2, 8, 5, 11, 9, 7, 13]
    data:  [15, 8, 4, 2, 6, 5, 11, 9, 7, 13]
    data:  [15, 8, 5, 2, 6, 4, 11, 9, 7, 13]
    data:  [15, 8, 11, 2, 6, 4, 5, 9, 7, 13]
    data:  [15, 9, 11, 8, 6, 4, 5, 2, 7, 13]
    data:  [15, 9, 11, 8, 6, 4, 5, 2, 7, 13]
    data:  [15, 13, 11, 8, 9, 4, 5, 2, 7, 6]
    """

# ソートを実行
for i in range(len(data), 0, -1):
    # ヒープの先頭と交換
    data[i - 1], data[0] = data[0], data[i - 1]
    j = 0
    while ((2 * j + 1 < i - 1) and (data[j] < data[2 * j + 1]))\
        or ((2 * j + 2 < i - 1) and (data[j] < data[2 * j + 2])):
        if (2 * j + 2 == i - 1) or (data[2 * j + 1] > data[2 * j + 2]):
            # 左下と交換
            data[j], data[2 * j + 1] = data[2 * j + 1], data[j]
            # 左下に移動
            j = 2 * j + 1
        else:
            # 右下と交換
            data[j], data[2 * j + 2] = data[2 * j + 2], data[j]
            # 右下に移動
            j = 2 * j + 2

    print('data: ', data)
    """
    data:  [13, 9, 11, 8, 6, 4, 5, 2, 7, 15]
    data:  [11, 9, 7, 8, 6, 4, 5, 2, 13, 15]
    data:  [9, 8, 7, 2, 6, 4, 5, 11, 13, 15]
    data:  [8, 6, 7, 2, 5, 4, 9, 11, 13, 15]
    data:  [7, 6, 4, 2, 5, 8, 9, 11, 13, 15]
    data:  [6, 5, 4, 2, 7, 8, 9, 11, 13, 15]
    data:  [5, 2, 4, 6, 7, 8, 9, 11, 13, 15]
    data:  [4, 2, 5, 6, 7, 8, 9, 11, 13, 15]
    data:  [2, 4, 5, 6, 7, 8, 9, 11, 13, 15]
    data:  [2, 4, 5, 6, 7, 8, 9, 11, 13, 15]
    """
